henrique/app/Controllers/PessoaController.php

    public function index()
    {

        $pessoaModel = new PessoaModel();
        $data["Dados"] = $pessoaModel->where("id >", 0)->findAll();
---
SELECT *
FROM `pessoa`
WHERE `pessoa`.`deleted_at` IS NULL

    public function create()
    {
        helper(['form', 'url']);
        $dados = [
            'nome' => $this->request->getPost("nome"),
            'email' => $this->request->getPost("email"),
            'telefone' => $this->request->getPost("telefone"),
        ];

        $model = new PessoaModel();
        $model->insert($dados);
---
INSERT INTO `pessoa` (`nome`, `email`, `telefone`, `created_at`, `updated_at`) VALUES ('Catarina', 'cat@gmail.com', '88888', '2022-11-22 20:08:33', '2022-11-22 20:08:33')

    public function edit($id = 0)
    {
        $model = new PessoaModel();
        $dados["pessoa"] = $model->find($id);
---
SELECT *
FROM `pessoa`
WHERE `pessoa`.`id` = '3'

    public function delete($id = 0)
    {
        $model = new PessoaModel();
        $model->delete($id);
---
DELETE FROM `pessoa`
WHERE `id` IN ('3')